Revit 2027 API
StructuralAsset.ConcreteCompression Property
 The compression strength of concrete-based assets.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double ConcreteCompression { get; set; }
Public Property ConcreteCompression As Double
	Get
	Set
public:
property double ConcreteCompression {
	double get ();
	void set (double value);
}
member ConcreteCompression : float with get, set
Property Value
Double
Exceptions
Exception | Condition
InapplicableDataException |  When setting this property: the material type must be concrete to set this property.
Remarks
 Applies to concrete-based structural assets. The value is in Newtons per foot meter (N/(ft · m)).
See Also
Reference
StructuralAsset Class
Autodesk.Revit.DB Namespace